<template>
  <section id="Contents" class="projectsSection">
    <h3 class="sectionTitle">PROJECT</h3>
    <div class="sectionWrap">
      <div class="projectList">
        <div class="projectItem" v-for="project in projects" :key="project.id">
          <a
            class="projectLink"
            :href="project.pjLink"
            target="_blank"
            rel="noopener"
          >
            <img
              class="projectImg"
              v-lazy="project.pjImg"
              loading="lazy"
              :alt="project.pjName + altText"
              width="288"
              height="162"
              decoding="“async”"
            />
            <p class="projectName">{{ project.id }} {{ project.pjName }}</p>
            <h5 class="projectTitle">{{ project.pjTitle }}</h5>
            <mq-layout :mq="['xl']">
              <p class="projectText">
                {{ project.pjText }}
              </p>
            </mq-layout>
          </a>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  data() {
    return {
      altText: "サムネイル画像",
      projects: [
        {
          id: 1,
          pjName: "安藤・土屋プロジェクト",
          pjTitle: "数学を数楽に\n～ 算数・数学の苦手意識を解決しmath ～",
          pjText:
            "算数・数学の中で苦手意識を抱きやすい分野にて、理解を深められる、または理解を補助できるサポートをしたいと私たちは考えました。そこで、算数・数学分野における、理解の補助を目的としたコンテンツ制作を目指しています。小、中、高生が本格的な勉強を始める前の基礎的な体験として、活用していただきたいです。イメージを可視化することで、計算過程を理解しやすくすることも目的の１つです。算数、数学が得意な人でも、四則演算の繰り返し、進数を使うなど、頭を使うので楽しめます。ゲームやおもちゃ、パズルなどを用いて、数値計算、進数、割合などを対象とした、理解の補助をする制作を想定していますが、オンラインが当たり前になりつつある現状を鑑みて、Webサイトの制作も視野に入れています。",
          pjImg: require("../assets/images/project_01.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-01",
        },
        {
          id: 2,
          pjName: "飯塚プロジェクト",
          pjTitle:
            "専大学版モノポリー制作 \n〜 大学を知るためのボードゲーム 〜",
          pjText:
            "飯塚プロジェクトではビジネスゲームに関する研究をテーマに活動しています。ビジネスゲームの一つとして「モノポリー」を題材とし、そこから専修大学オリジナルのビジネスゲームを作成することにしました。モノポリー（英語：Monopoly）は20世紀初めに米国生まれたボードゲームの一つで、現在特許は期限切れとなり、著作権も存在しないため、モノポリー形式を踏襲したゲームが独立系のゲームメーカーから数多く開発されています。「モノポリー」から得るビジネスの知識には取引、土地の売買、競売、資金調達といった要素がありますが、それらの要素からヒントを得て新たな要素を自分達で考案しそれをもとに作成していく予定です。また、作成後もただ作って終わりではなく自分達が実際にプレイしどういった戦略でゲームに勝つかどうしたら相手に不利な状況を作れるのかといった戦略を分析し機能に反映させる予定です。",
          pjImg: require("../assets/images/project_02.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-02",
        },
        {
          id: 3,
          pjName: "石井プロジェクト",
          pjTitle: "オンラインをより身近に \n〜 人を集めるプロジェクト 〜",
          pjText:
            "石井プロジェクトでは'人を集める'をテーマに、イベントの企画運営を考えることになりました。そこで、どのようにして人を集めるかを考えたところ、内部の人を集める専修大学生対象の学内SNSと、外部の人を集める小学生対象の工作体験会に分かれました。 学内SNSでは、コロナの影響で、学内での対面の交流が現状難しく、専修大学生同士の交流をオンラインでサポートしたいと考えた時、学内SNSがあれば便利ではないかと思いこれを企画しました。Discordを用いた、最大20,000人の大規模な専修大学生向けのオンライン交流会やゲーム大会のようなイベントの企画運営などを行う'学内ネットワーク'という名前のサーバーの設立及び管理をしています。 工作体験会では、「一緒におもちゃを『作って』遊んでみよう」をテーマとしました。オンラインで外部の小学生を対象としたモノづくりの場を提供するとともに、子供と親のコミュニケーションの場を提供し、楽しんでもらう場を提供することを目標とします。",
          pjImg: require("../assets/images/project_03.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-03",
        },
        {
          id: 4,
          pjName: "石鎚プロジェクト",
          pjTitle: "ほしがり！ヌートカトン \n〜 今日のおやつは彼が決める 〜",
          pjText:
            "健康管理×女性向け乙女ゲームを提案する。ダイエットでは、モチベーションを落とさず継続することが重視されるが、既存の健康管理アプリは、エンターテインメント要素が少なく単調なものが多い。そこで、本プロジェクトでは、近年人気を集めている“女性向け乙女ゲーム”の要素を取り入れたアプリ開発を行う。モチベーションになりうる要素（2Dイケメン男子)を組み込み、これまでにないエンターテイメント的アプローチによる新感覚健康管理乙女ゲームの制作が最終目標である。具体的には、ストーリーに出てくるキャラクターから一人選択し、そのキャラクターに課せられるデイリーミッションをクリアしていく、また、タスク完了型で、運動のフリーメニューも選択するといった内容を考えている。通知やストーリー内でのアドバイス・アナウンスなども行い、健康管理に関連する情報の提供とともに、健康管理を習慣づける機能も搭載する予定である。",
          pjImg: require("../assets/images/project_04.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-04",
        },
        {
          id: 5,
          pjName: "上松プロジェクト",
          pjTitle: "mutual park ネ学専用コンテンツ",
          pjText:
            "上松プロジェクトは大学生として過ごす時間をより記憶に残るものにはどうしたら良いかを考え、学生生活に輝きを見つける手助けを目的として活動している。「学生生活を手助けできるサービスとはなんだろうか」について考えた結果、「mutual park」というwebサービスを企画し、開発を進めている。「mutual park」には、三つの機能があり、ポートフォリオ・雑談・共有がある。ポートフォリオは自分の広告（myself Advertisement）としてネ学の授業や個人活動で行ったことをまとめられる機能である。雑談はお互いを思い合う心(kind heart)を持ち、互いの疑問などをコメント式で解決できる機能である。共有は自分の成果物(product)を載せ、「評価、参考、自己満、交流」を目的とした機能である。これらの機能を活用することで、学生生活で起こりうるさまざまなイベントや、課題の解決や就活の充実に役立てることができる。「mutual park」の重要な目的は、大学生として過ごす時間をより記憶に残るものにし、学生生活に輝きを見つける手助けを行うことである。",
          pjImg: require("../assets/images/project_05.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-05",
        },
        {
          id: 6,
          pjName: "江原プロジェクト",
          pjTitle:
            "VTuberの面白さを広げ、ユーザーとコンテンツの橋渡しをしていくプロジェクト",
          pjText:
            "江原プロジェクトでは、「VTuber」の配信を見て、各々が面白かったシーンを厳選し、編集を加えた切り抜き動画やイラストで表した切り抜き動画などを作り、YouTubeに投稿することで、「VTuber」を見たことがない人や「VTuber」に興味があるが手をつけられていない人に向けて広めていくことが主な活動である。そして、どのような動画が再生数が伸びる傾向にあるのかを調べてデータベースとして蓄積していく。加えて、現在YouTubeに投稿されている切り抜き動画で再生回数の多い動画を見て、その動画の特徴を捉えていき、どのような切り抜き動画が伸びているかの傾向を掴んだ上で動画作成を行なっていく。どのようなジャンルの動画が切り抜き動画として多く投稿されているのかということも掴んでいく。また、VTuberを広める新しいサービスを作成し、既存のサービスとの差別化を図る。",
          pjImg: require("../assets/images/project_06.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-06",
        },
        {
          id: 7,
          pjName: "大澤プロジェクト",
          pjTitle: "繊細な人に寄り添う\n病気がちHAIエージェント",
          pjText:
            "大澤プロジェクトでは、メンヘラのための「友達のように人に寄り添うエージェント」を作っている。なぜなら、心が弱っていて苦しんでいる人と、その人によって苦しむ周りの人を助けたいと思ったからだ。私たちの作るエージェントは、一般的に想像される「達人ロボット」ではない。人の助けを必要とする弱いロボットだ。あえて弱みを見せることによって、自然と人の行動を促すことができるのだ。例えば、部屋が汚いとエージェントの具合が悪くなり、ユーザーは自分の好きな存在が苦しんでいるのを可哀想だと思い部屋を片付ける。この仕組みはメンヘラを助けるためにとても有効だ。なぜなら、他者に優しくすることはストレスを軽減するからだ。また、ユーザーは他者によって促され、自発的になることにより、行動を起こしやすくなり、自分で片付けたという自信も得られる。このプロダクトにより、メンヘラがより明るく過ごせる時間を実現する。",
          pjImg: require("../assets/images/project_07.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-07",
        },
        {
          id: 8,
          pjName: "太田プロジェクト",
          pjTitle: "心へのアプローチ\n〜 心を動かす要素とは 〜",
          pjText:
            "この概要を読んでいるあなたに質問です。「あなたは、何に感動しますか？」それは人に説明できますか？私たちのプロジェクトのテーマは「心を動かす要素を探す」ことです。 「心を動かす要素」を知ることができれば、私たちが伝えたい考えや意図（＝つまりテーマ）が、より相手に伝えやすくなるのではないでしょうか？私たちはそれを知るため様々な議論や調査を行い、具体化を行います。その後、それが一般的に心を動かす要素になりうるものなのかについて、具体化を行った要素を盛り込んだシナリオによる、２Dゲーム制作を行いゲームコンテストへ応募します。果たして成果物が、人の心を動かすゲームとなったのか、外部からの評価を吟味し、最終発表に向けさらに磨かれたものにする予定です。私たちの「心を動かす要素」が、あなたにも届きますように。",
          pjImg: require("../assets/images/project_08.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-08",
        },
        {
          id: 9,
          pjName: "尾形プロジェクト",
          pjTitle:
            "AIで自分の理想にチャレンジ!?\n～ OpenPoseの骨格認識を使って、スポーツ•Zoom•日常を最適化 ～",
          pjText:
            "尾形プロジェクトは、人の体の“動き”に着目し、言葉では表現しにくいプロの技の秘密や多様性を探求、また、これまでにない“動き”の活用方法を提案します。メンバは、７種類の“理想”の実現にチャレンジします。スポーツでは、“理想のフォームを追求し、球速をあげたい（野球）”、“その人に合ったフォームを追求し、3ポイントシュートの成功率を向上させる（バスケ）”、“無回転シュートを体得する（サッカー）”、さらに、ヘルスケアでは、“歩く姿勢からその人の健康状態を推測する”、また、コロナ禍のニューノーマルへの支援として、“リモートミーティングをもっと快適にする”、“モノに触れないで意思を伝達するTouchless-Solutionを探る”、“体に合わせてリアルタイムに動作するインタフェースを作る”を設定しました。プロトタイプは、スマホ撮影や既存の動画を元に、openpose、yolo、Zoom、Jetson、画像変換などをベースに、独自開発を追加します。特殊な機器を用いない導入しやすい方法で、新しい知的領域を切り開く可能性を追求します。",
          pjImg: require("../assets/images/project_09.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-09",
        },
        {
          id: 10,
          pjName: "小田切プロジェクト",
          pjTitle: "Remixer\n〜 誰でも簡単にできる新しいDJ体験 〜",
          pjText:
            "小田切プロジェクトでは、新しい作曲方法の提案を目標として活動しています。その上で、中間発表までの成果物として目標としているのは、「誰でも簡単にできる新しいDJ体験」です。具体的には、Leap motionで手の動きを検出して、画面上に表示されているアイコンに触れたり拍手など特定のアクションをしたりすることで、複数の既存の曲を再構成した自分だけの曲を作るという体験の実装です。選択される「既存の曲」とは、画面上での選択を通じてユーザの好みを自動的に判断して選ばれた30秒の楽曲になります。選択された複数の曲を自動的につなぎあわせることで、再構成された自分だけの曲が作成されます。最終的には、再構成された曲をMP3ファイルとして保存し、そのデータを自分の手元でいつでも聞けるようにすることを目指しています。",
          pjImg: require("../assets/images/project_10.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-10",
        },
        {
          id: 11,
          pjName: "神白プロジェクト",
          pjTitle: "毎日みんなで洋書を読んで読んで読みまくるプロジェクト",
          pjText:
            "私たちは、日本で習う単語帳や文法書中心の勉強ではなく、「英語のペーパーバッグの輪読を継続する」という勉強方法で英語学習を約１年間継続し、定期的に英語力を測るためにTOEICを受験します。日本では何年も英語を勉強しているのに英語を使えるようにならない、もしくは英語を使うことに抵抗感がある人が多く、その原因がこれまで主流とされてきている黙々と単語帳や文法書の内容を暗記する勉強方法にあると考えました。そこで従来の勉強方法は基本的に使用せず、日本人には学習方法として馴染みの無い英語の輪読のみを勉強方法とし、この方法が暗記中心の学習方法と比べてどのようなメリットがあるのか、英語学習が上手くいっていない人の手助けとなる学習方法になるのか検証します。",
          pjImg: require("../assets/images/project_11.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-11",
        },
        {
          id: 12,
          pjName: "金子プロジェクト",
          pjTitle: "マイクを搭載したドローンの改良と新しい応用",
          pjText:
            "なぜマイクをドローンにつける必要があるのだろうか。スマホとパソコンはコミュニケーションのため、ペットロボットは声で操作するため、デジカメはその場の音を取るために必要。ドローンにマイクをつけることで、ドローンもこのような使い方ができる。マイクのついたドローンの研究は多く見つかるが実用化の例は全く見つからない。なぜなら、ドローンの騒音を消すことが難しいからだ。昨年度のプロジェクトでこの課題に取り組みドローンにマイクを装着する新たな方法を考案し、ある程度良好な音声を収録できることを確認した。昨年度、プロトタイプ（試作品）を作ったが、実験を優先したため、実用的な形ではなかった。今年はその改良と応用を目指して、収音の改良を行うマイク班、用途を考える応用班、広報活動を行うアウトリーチ班の3つに分かれて活動する。",
          pjImg: require("../assets/images/project_12.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-12",
        },
        {
          id: 13,
          pjName: "栗芝プロジェクト",
          pjTitle:
            "親子×コミュニケーション＝笑顔\n〜 新しいコミュニケーションの仕組みをつくろう 〜",
          pjText:
            "コロナの影響で、思うようにコミュニケーションが取ることができず、笑顔が少なくなっているように感じます。そこで私たちは、笑顔やコミュニケーションに関して様々な事例やデータを収集し、どのような場所や時でそれらが不足しているか調査をしました。生まれてから死ぬまで一生関係を維持し続ける親子。しかし、親と子にある溝がある家庭は少なくないでしょう。「日常的なコミュニケーション不足」と「思い出不足」という2つの問題から解決策を探していきます。栗芝プロジェクトでは、ひろがる笑顔（自分の中でも、家族の中でも、友達の中でも、知らない誰かの中でも笑顔を広げていくこと）を軸に親子の間に新たなコミュニケーションの仕組みを作ることを目指します。",
          pjImg: require("../assets/images/project_13.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-13",
        },
        {
          id: 14,
          pjName: "河野プロジェクト",
          pjTitle: "ゲームで学ぶゲーム理論",
          pjText:
            "本プロジェクトでは「ゲームで学ぶゲーム理論」をテーマにゲーム理論を学ぶためのゲームを制作することを考えている。制作したゲームは実際にゲームの理論の講義などで多くの人にプレイしてもらい、理論的な予測と実際の結果がどのくらい同じなのか違うのか、違うとしたらそれは何が原因なのかを探求することも併せて行いたい。本プロジェクトはここまでの活動で、2社の企業が互いに相手の企業の生産量を予想して、自身の企業の利益を最大にするような生産量を考えるゲームである寡占のゲームと、2人のプレイヤーがそれぞれ3枚の番号札と1枚の絵札をもち、それぞれが１枚のカードを選択して勝敗を決めるトランプ・ゲームの2つのゲームを制作した。今後は同様のゲームをいくつか制作し、それらのゲームから集計したデータを分析する予定である。",
          pjImg: require("../assets/images/project_14.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-14",
        },
        {
          id: 15,
          pjName: "小林プロジェクト",
          pjTitle:
            "革命的なシャワーヘッドの開発\n〜 企業と連携、ゼロからの挑戦 〜",
          pjText:
            "私達が普段何気なく使っているシャワーヘッドですが、その進化は目覚しく次々と新たな製品が販売されています。小林プロジェクトでは、業界トップレベルのシャワーヘッドメーカーとタイアップし、独創的なシャワーヘッドの開発を行っています。ターゲットユーザーは30〜50代の肩こりに悩む女性です．その課題を解決するために、今回、浴室でマッサージができるシャワーヘッドを企画しました。さらに、地球に優しい製品を目指すためにパッケージのデザインや素材を工夫しました。今後、製品のデザイン、設計、パッケージのデザイン、マーケティングなどをメーカー協力して行っています。そして、今年度中に市場リリースすることを目指します。",
          pjImg: require("../assets/images/project_15.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-15",
        },
        {
          id: 16,
          pjName: "佐竹プロジェクト",
          pjTitle: "悪霊ばすたー\n～ ゲーム×リズムで運動不足を解消する ～",
          pjText:
            "コロナウイルスの流行によって、外出制限を余儀なくされた人々の間に運動不足による不調が目立ち始めている。特に、大学生は対面授業が再開していない学校が多いため、通学などの日常生活レベルの運動すらできていない。 家の中で楽しく運動ができる方法を考えたところ、ゲームと掛け合わせられることを思いついた。今までにも運動を題材にしたゲームはあったが、それらはいずれも「運動」を主軸にしたものが多い。そのため、プレイヤーにとっては運動をしているという感覚が強く、長続きがしなかったり、日常生活レベルの運動をしていない人にはハードルが高かったりしてしまう。また、ゲームとしての面白さが蔑ろになっているという側面もある。そこで、本プロジェクトでは「ゲームをしていて気づいたら運動ができていた」というコンセプトのゲームを制作する。",
          pjImg: require("../assets/images/project_16.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-16",
        },
        {
          id: 17,
          pjName: "佐藤プロジェクト",
          pjTitle: "苦手な視点から、虫と親しみを持つためのボードゲーム制作",
          pjText:
            "私たち佐藤プロジェクトは、メンバー全員が虫を苦手としていることから、虫たちの苦手意識を変え、親しみを持つためのコンテンツ制作を提案します。　虫を知るために調べたり、触れたり、食べるなど、さまざま角度から虫と関わりを持ってきました。この関わり合いから、嫌悪感や苦手意識を持つ理由として、「虫のことをよく知らない」という原因に辿り着きました。そこから、虫と楽しく関わる機会を生み出し、学ぶことができるコンテンツが必要だと考え、「ミツバチの一生を楽しく学べるボードゲーム」を開発します。苦手なものに対して直接的に関わることは、非常に難しいことだと思います。私たちの開発するコンテンツは苦手意識を少しでも克服できるようになることを目指しています。",
          pjImg: require("../assets/images/project_17.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-17",
        },
        {
          id: 18,
          pjName: "杉田プロジェクト",
          pjTitle:
            "10xS Project\nshake your heart\n〜 私たちの表現を、今できる場所で 〜",
          pjText:
            "大学にもっと、表現の場を!　アート体験を!人々をつなぐ架け橋に!私たちは、音楽や演劇、ダンスなど、異なる表現手段で、それぞれの場所で活動してきたが、コロナ禍によりその場の多くが奪われてしまった。いま改めて表現とは何か、何のために表現をするのか、自分たちにも何かできることがあるのではないかと考えた。そこで、さまざまな表現の歴史を学びながら、大学を舞台に、私たちにしかできない新たな<表現>を試行する。<表現>による、新たなコミュニケーションやつながりの形成を目指す。４月には、新入生歓迎の気持ちを表す映像作品の上映とライブパフォーマンスを行った。また５月からは毎週水曜昼休みにラジオ番組「オールヌーンセンシュウ」を配信している。ほか現在は、マッピングパフォーマンス、展示、映像制作の３つのグループに分かれてそれぞれの作品を制作を進めている。今後の感染症の状況を注視しながら、新たな表現の可能性を模索する。",
          pjImg: require("../assets/images/project_18.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-18",
        },
        {
          id: 19,
          pjName: "鈴木プロジェクト",
          pjTitle:
            "Privacy Protective Camera (PPC)\n～ 匿名性を維持しつつ混雑状況を把握するシステムの研究・開発 ～",
          pjText:
            "人の混雑状況の把握においてプライバシーの保護は不可欠である。近年のプライバシー問題の実例として公共の建物の窓付近に防犯目的で置いたカメラが、顔を識別できるほど映ってはいないものの体が鮮明に映るということで損害賠償が求められたというものがある。このような事例から私たちは個人情報を取得できないセンサ類を用いる方法や個人情報が特定できてしまう情報を加工する方法が適切な手段と考えた。しかし、前者のセンサを用いた方法では設置場所が多数に増えてしまうことが予想される。そこで、後者のような予め撮影段階でぼかしなどの加工をした状態のカメラ映像を用いてプライバシーへ十分な配慮をしつつ、機械学習によって混雑状況を把握させることで利便性を向上させたシステムの研究・開発を行う。",
          pjImg: require("../assets/images/project_19.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-19",
        },
        {
          id: 20,
          pjName: "砂原プロジェクト",
          pjTitle:
            "「教育の歴史を探る」\n～　感染症がもたらした教育の場の変化 ～",
          pjText:
            "　新型コロナウイルスは我々の生活に大きな影響を及ぼした。学校教育の場においては、授業の形態が対面からオンラインへの変更を余儀なくされた。われわれはこの変化に戸惑いや不安を感ずることも多かったが、同時にまた、それぞれの授業形態の特徴を改めて考えることにもなった。 　2021年度の砂原プロジェクトは、新型コロナウイルス感染症の流行があらためて浮き彫りにした教育のさまざまな側面を、歴史的な観点から考察しようとしている。またこの考察を踏まえ、学校教育を含む教育全体がポストコロナの時代にどう変化していくのかも考えたいと思っている。 　プロジェクトの活動としては、上記の問題意識のもとで各メンバーが各々の関心領域についての歴史を調べた内容と、それについてのメンバー全体での議論の内容を冊子等の形にまとめることを考えている。   ",
          pjImg: require("../assets/images/project_20.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-20",
        },
        {
          id: 21,
          pjName: "田中プロジェクト",
          pjTitle:
            "データから読み解く自然災害\n〜 災害情報から災害大国の本質に迫る 〜",
          pjText:
            "我が国は世界でも有数の災害大国であり、特に年間地震発生回数では世界4位という事実からも、常に自然災害の脅威と対峙していかなければならない。よって万が一に備えるためにも、国や地域などにおける災害情報の関連性を明らかにするべく、統計学の視点から研究を実施する。中でも地震については、日頃の防災教育や家庭対策において、発生時の被害を軽減するために「地震が起きた時にどう動くか」を想定した取り組みがなされてきた。その一方で「地震発生のタイミング予測」にも目を向けることで、災害発生前後両面での対策を支援していきたいと考える。加えて水害に関わる事象では、令和元年台風第19号をはじめとした災害事例や、それに伴う問題点および改善策が報告されている。このような水害対策に寄与するため、日本の水害被害と地域的要因との関係性を分析し、その因果関係を明らかにするなど、水害における統計的情報の関連性について研究を進めていきたいと考えている。",
          pjImg: require("../assets/images/project_21.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-21",
        },
        {
          id: 22,
          pjName: "仲俣プロジェクト",
          pjTitle: "実写とアニメーションを融合した映像作品",
          pjText:
            "実写とアニメーションを融合させた約30分の映像作品を作成する。実写の映像にアニメーションを加えることで、新鮮な映像になるのではないかと考えたからだ。作品のテーマは「頑張る」。人生のなかで誰しも経験があることだが、「頑張る」とは一体なんなのか？「自分で満足する」ものか「結果が全て」か、それとも「他人に認められること」なのか？本当の「頑張る」とはいったい何かを、映像を見る人にも考えてもらいたい。ストーリーは、就活を始めようとしている大学３年生の男子生徒Aと、海外留学のために就活はしてない大学３年生の男子生徒Bの二人を軸に進む。Aはインターン応募先で面接官に厳しいことを言われ、頑張ることについて見失っている。そんなとき、Aは親友のBが人知れず努力しているところを偶然目撃する。その後、Aは何を思い、どう行動していくのか？この作品を見てくれた人も何かを考え、行動したくなるような作品を目指す。",
          pjImg: require("../assets/images/project_22.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-22",
        },
        {
          id: 23,
          pjName: "沼プロジェクト",
          pjTitle: "古式遊具再誕計画",
          pjText:
            "皆さんはレトロアナログゲームで遊んだことはありますか?(黑ひげ危機一髪、野球盤、ポカポンゲーム、人生ゲームetc...)レトロアナログゲームは単純ゆえに楽しく、単純ゆえに飽きやすい、現代人には「ちょっと物足りない」ゲームです。沼プロジェクトでは、伝統的な「ちょっと物足りない」レトロアナログゲームを、「あともう一回遊びたい!」と思わず言いたくなるゲームとして進化させたいと考えています！加えて、既存の枠組みにとらわれない全く新しい体感型ゲームの新規開発を予定しています！具体的にどのように進化・開発を行うのかについてですが、ユーザが指先で操作するものではなく、センサやアクチュエータなどを用いた己の身体を使って操作する「没入感の高い遊び」へと昇華させようと考えています。",
          pjImg: require("../assets/images/project_23.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-23",
        },
        {
          id: 24,
          pjName: "藤原プロジェクト",
          pjTitle: "短編映像の企画・制作",
          pjText:
            "情報技術の発達にともない、映像による情報の表現や発信が進展する一方で、メディア・リテラシーの重要性も増しています。このプロジェクトでは、短編映像の企画・制作をテーマとして設定し、短編映像の企画・制作に関する知識と技術を互いに学び、向上させ、人に伝わる短編映像を企画・制作することを目的とします。具体的な活動としては、企画、構成、撮影、編集、公開などの映像制作に関する文献・資料等の講読と実践を学生同士が協同で行い、専門的知識と技術の修得を目指します。また、短編映像の企画・制作を通じて、メディアの特性を理解し、送り手としてどのように表現・発信するか、受け手としていかに映像を読み解くかを考えていきます。",
          pjImg: require("../assets/images/project_24.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-24",
        },
        {
          id: 25,
          pjName: "望月プロジェクト",
          pjTitle:
            "自分とスマートフォンを引き離すことで睡眠の質を向上させる新たなモノ作り",
          pjText:
            "「眠いのにスマートフォンから目が離せず、ダラダラと時間が過ぎてしまい気付いたら寝落ちをしていた。」「しっかり寝たはずなのに気持ちよく目覚めることが出来ない。」望月プロジェクトでは、様々な睡眠に関する悩みに対して寝付きや寝起きを現状よりも改善することを目指して、デジタルとアナログの両方向からアプローチをした製作物を作ることを活動テーマとしています。製作物の対象者は大学生です。私たちはスマートフォンから発せられるブルーライトは睡眠の質を低下させると言うことに着目しました。そこで、寝る前にほとんどの人がしている”スマートフォンの充電”をトリガーとし、ユーザーの生活のルーティンを変えずにスマートフォンと距離を置くように仕向ける方法を考えます。そして、ユーザーの快適な睡眠や起床の助けとなる製作物を構築していきます。これによって製作物が睡眠の悩みを解決することができたらと考えています。",
          pjImg: require("../assets/images/project_25.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-25",
        },
        {
          id: 26,
          pjName: "山下プロジェクト",
          pjTitle:
            "“一緒にいる感覚”のデザイン \n～「“伝えたい”を伝える」コミュニケーションツール ～",
          pjText:
            "私達は、既存のSNSにおけるコミュニケーションの無機質さに問題を感じ、その問題点を改善するチャットツールのデザイン・開発をしている。　LINEなどのSNSで相手の反応が「素っ気ない」と感じたことは無いだろうか。例えば次のような場面である。A「またカラオケ行こうね」B「うん。」このような素っ気なさを改善することを目標としている。解決策として、ユーザーが伝えたいことを表現しやすいデザインにすることを考えている。例えば、「笑」や「www」といった笑っていることを示す表現があるとき、文字を揺らしたり、跳ねさせたりするような動きの効果をつけ、メッセージを送れるといった機能を検討している。このような独自の手法を取り入れることにより、無機質さを改善できると考えている。他にも「より効果的な表現方法」を「手間をかけずに使える」ようにデザインする方針だ。",
          pjImg: require("../assets/images/project_26.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-26",
        },
        {
          id: 27,
          pjName: "吉田・小杉プロジェクト",
          pjTitle: "GANを用いたマインクラフトの画像とリアル画像の変換",
          pjText:
            "私たちは、AIを使ってシステムやサービスを作りたいという目的のためにこのプロジェクトに集まった。そして様々なAIについて学び、ここ数年飛躍的に進歩を遂げているGAN(Generative Adversarial Networks敵対的生成ネットワーク)と呼ばれる技術による画像変換に注目した。GANは従来の画像領域のAI技術を組み合わせることで画像生成や画像変換を実現できるようにした技術である。この画像変換技術を調べていく中で、マインクラフトのゲーム画像を現実画像の変換できないかと考えた。マインクラフトは、仮想空間で3Dのブロックを積み上げてものづくりを楽しむゲームで、専門的な知識などがなくても家や街並みなどの立体的な作品を作成できる。現在、このマインクラフトで作成された画像を、GANを用いて画像変換させてみたいと取り組んでいる。また今後、これを用いた個人ユーザ向けの、操作性の良い画像変換プラットフォームを提供したいと考えている。",
          pjImg: require("../assets/images/project_27.png"),
          pjLink: "https://www.ne.senshu-u.ac.jp/~proj2021-27",
        },
      ],
    };
  },
};
</script>

<style scoped>
h2,
h3 {
  color: var(--text-green);
  text-align: center;
}

h5 {
  color: var(--text-black);
}

.projectsSection {
  position: relative;
  width: 100%;
  height: 100%;
  min-height: 100vh;
  background-color: var(--bg-white);
  overflow: hidden;
}

.projectList {
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  margin: 0 -10px;
  padding: 80px 0 120px 0;
}

.projectList::before,
.projectList::after {
  display: block;
  content: "";
  width: 300px;
  margin: 0 10px 60px 10px;
}

.projectList::before {
  order: 1;
}

.projectItem {
  position: relative;
  display: flex;
  flex-wrap: nowrap;
  flex-direction: column;
  justify-content: stretch;
  cursor: pointer;
  overflow: hidden;
  width: 300px;
  min-height: 100%;
  margin: 0 10px 60px 10px;
  color: var(--text-black);
  border-radius: 6px;
  background-color: var(--text-white);
  box-shadow: 0px 1px 3px 0px #00000026;
  transition: 0.3s;
}

.projectItem:hover {
  transform: translate(0, -4px);
  opacity: 0.7;
}

.projectItem p {
  color: var(--text-black);
}

.projectLink {
  flex-grow: 1;
}

.projectImg {
  width: 282px;
  height: 162px;
  margin: 10px 9px;
  box-shadow: 0px 1px 3px 0px #00000026;
  background-image: url("../assets/images/project_load.png");
  background-size: contain;
  background-position: center;
  background-repeat: no-repeat;
}

.projectName {
  margin: 0 9px 10px 24px;
  font-size: 0.8rem;
  opacity: 0.7;
  font-family: "Noto Sans JP", "Helvetica Neue", "Helvetica", "Hiragino Sans",
    "Hiragino Kaku Gothic ProN", "Arial", "Yu Gothic", "Meiryo", sans-serif;
}

.projectTitle {
  height: 130px;
  text-align: justify;
  font-size: 1.1rem;
  margin: 0 24px;
  white-space: pre-wrap;
  word-wrap: break-word;
  font-family: "Noto Sans JP", "Helvetica Neue", "Helvetica", "Hiragino Sans",
    "Hiragino Kaku Gothic ProN", "Arial", "Yu Gothic", "Meiryo", sans-serif;
}

.projectText {
  margin: 16px 24px 40px 24px;
  padding-top: 20px;
  color: var(--text-black);
  border-top: solid 1px var(--bg-black);
  font-size: 0.9rem;
  letter-spacing: 1.3px;
  line-height: 1.75;
  font-family: "Noto Sans JP", "Helvetica Neue", "Helvetica", "Hiragino Sans",
    "Hiragino Kaku Gothic ProN", "Arial", "Yu Gothic", "Meiryo", sans-serif;
}

@media screen and (max-width: 959px) {
  .projectTitle {
    font-size: 1rem;
  }
}

@media screen and (max-width: 690px) {
  .projectList {
    justify-content: space-around;
  }
}

@media screen and (max-width: 415px) {
}
</style>